In [1]:
%matplotlib inline
import pandas as pd

In [8]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [10]:
titles = pd.DataFrame.from_csv('data/titles.csv',index_col=None)
titles.head()

                 title  year
0  La mano que aprieta  1952
1  The Insatiable Moon  2010
2             Die Wand  2012
3        Profound Loss  2010
4         Mystery Lake  1953

In [5]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [11]:
len(titles)

238429

### What are the earliest two films listed in the titles dataframe?

In [16]:
titles.sort_values('year').head(2)

                     title  year
10152           Miss Jerry  1894
167760  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [21]:
len(titles[(titles.title=='Hamlet')])

20

### How many movies are titled "North by Northwest"?

In [23]:
len(titles[(titles.title=='North by Northwest')])

1

### When was the first movie titled "Hamlet" made?

In [25]:
titles[(titles.title=='Hamlet')].sort_values('year').head(1)

        title  year
19394  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [26]:
titles[(titles.title=='Treasure Island')]

                  title  year
2231    Treasure Island  1950
25127   Treasure Island  1918
111518  Treasure Island  1972
163840  Treasure Island  1920
195229  Treasure Island  1934
198409  Treasure Island  1985
220298  Treasure Island  1999
237840  Treasure Island  1973

### How many movies were made in the year 1950?

In [33]:
len(titles[(titles.year==1950)])

1111

### How many movies were made in the year 1960?

In [34]:
len(titles[(titles.year==1960)])

1538

### How many movies were made from 1950 through 1959?

In [37]:
len(titles[(titles.year>=1950) & (titles.year<=1959)])

12877

In [44]:
len(titles[titles.year // 10 == 195])

12877

### In what years has a movie titled "Batman" been released?

In [39]:
titles[titles.title=='Batman']

         title  year
13624   Batman  1989
171738  Batman  1943

### How many roles were there in the movie "Inception"?

In [42]:
len(cast[cast.title=='Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [78]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.isnull()]
len(c)

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [79]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.notnull()]
len(c)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [99]:
c = cast
c = c[c.title == 'North by Northwest']
c = c[c.n.notnull()]
c = c.sort_values('n')
c

,title,year,name,type,character,n
872607,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3495953,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1458720,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3144201,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
357300,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3038462,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1697118,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1276553,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2449970,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1813377,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
666701,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2298415,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
465364,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1510092,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206749,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1386147,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [102]:
c=cast
c=c[(c.title=='Sleuth') & (c.year==1972) ]
c=c.sort_values('n')
c

,title,year,name,type,character,n
1707308,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
327269,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
374529,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1467020,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2722532,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1450232,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [103]:
c=cast
c=c[(c.title=='Sleuth') & (c.year==2007) ]
c=c.sort_values('n')
c

          title  year                 name     type          character    n
327270   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1294875  Sleuth  2007             Jude Law    actor               Milo  2.0
1807904  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260596   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
374530   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2722531  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3351888  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [104]:
c=cast
c=c[(c.title=='Hamlet') & (c.year==1921) ]
len(c)

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [105]:
c=cast
c=c[(c.title=='Hamlet') & (c.year==1996) ]
len(c)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [108]:
c=cast
c=c[(c.character=='Hamlet') ]
len(c)

95

### How many people have played an "Ophelia"?

In [116]:
c=cast
c=c[(c.character=='Ophelia')].name.unique()
len(c)

111

### How many people have played a role called "The Dude"?

In [110]:
c=cast
c=c[(c.character=='The Dude') ]
len(c)

19

### How many people have played a role called "The Stranger"?

In [111]:
c=cast
c=c[(c.character=='The Stranger') ]
len(c)

214

### How many roles has Sidney Poitier played throughout his career?

In [113]:
c=cast
c=c[(c.name=='Sidney Poitier') ]
len(c)

43

### How many roles has Judi Dench played?

In [114]:
c=cast
c=c[(c.name=='Judi Dench') ]
len(c)

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [115]:
c=cast
c=c[(c.name=='Cary Grant') & (c.year==1940)  & (c.n==2)]
c

                   title  year        name   type   character    n
872604  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [117]:
c=cast
c=c[(c.name=='Cary Grant') & (c.year==1940)  & (c.n==1)]
c

,title,year,name,type,character,n
872588,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
872629,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
872631,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [123]:
c=cast
len(c[(c.year// 10== 195) & (c.type=='actor') ].character.unique())

93327

### How many roles were available for actresses in the 1950s?

In [124]:
c=cast
len(c[(c.year// 10== 195) & (c.type=='actress') ].character.unique())

36045

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [129]:
c=cast
c=c[(c.year<=1980)  & (c.n==1)]
len(c)

64891

### How many non-leading roles were available through from the beginning of film history through 1980?

In [128]:
c=cast
c=c[(c.year>=1940)  & (c.n!=1)]
len(c)

3310693

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [135]:
c=cast
c=c[(c.year<=1980)]
c=c[c.n.isnull()]
len(c)

446433